/**
全站通用类
*/

exports.replaceAll = function(achar,charA,charB){
	var rep = new RegExp(charA,"g");
    return achar.replace(rep,charB);
}

exports.iossoftcatekey = [6018,6000,6022,6017,6016,6015,6023,6013,6012,6020,6011,6010,6009,6021,6008,6007,6006,6005,6004,
6003,6002,6001];
exports.iosgamecatkey = [6014,7001,7002,7003,7004,7005,7006,7007,7008,7009,7010,7011,7012,7013,7014,7015,7016,7017,7018,7019];

exports.iossoftcate = {
	6018:"图书",
	6000:"商业",
	6022:"商品指南",
	6017:"教育",
	6016:"娱乐",
	6015:"财务",
	6023:"美食佳饮",
	6013:"健康健美",
	6012:"生活",
	6020:"医疗",
	6011:"音乐",
	6010:"导航",
	6009:"新闻",
	6021:"报刊杂志",
	6008:"摄影与录像",
	6007:"效率",
	6006:"参考",
	6005:"社交",
	6004:"体育",
	6003:"旅行",
	6002:"工具",
	6001:"天气"
	
}
exports.iosgamecat = {
	6014:"全部游戏",
	7001:"动作游戏",
	7002:"探险游戏",
	7003:"街机游戏",
	7004:"桌面游戏",
	7005:"扑克牌游戏",
	7006:"娱乐场游戏",
	7007:"骰子游戏",
	7008:"教育游戏",
	7009:"家庭游戏",
	7010:"儿童游戏",
	7011:"音乐",
	7012:"智力游戏",
	7013:"赛车游戏",
	7014:"角色扮演游戏",
	7015:"模拟游戏",
	7016:"体育",
	7017:"策略游戏",
	7018:"小游戏",
	7019:"文字游戏"
}